# language: fa
ویژگی: ورود به دیجی‌پی
  به عنوان کاربر دیجی‌پی
  می‌خواهم با شماره موبایل وارد شوم
  تا بتوانم از سرویس‌های مالی استفاده کنم

  سناریو: ورود با شماره موبایل معتبر و رسیدن به مرحله کد تایید
    با فرض کاربر صفحه ورود دیجی‌پی را باز کرده است
    هنگامی که شماره موبایل معتبر خود را وارد می‌کند
    آنگاه باید وارد مرحله دریافت کد تایید شود

  سناریو: جلوگیری از ورود با شماره موبایل نامعتبر
    با فرض کاربر صفحه ورود دیجی‌پی را باز کرده است
    هنگامی که شماره موبایل نامعتبر وارد می‌کند
    آنگاه باید پیام خطای اعتبارسنجی شماره موبایل را ببیند
