# language: fa
ویژگی: خرید شارژ مستقیم
  به عنوان کاربر دیجی‌پی
  می‌خواهم شارژ مستقیم موبایل بخرم
  تا بتوانم سیم‌کارت مقصد را شارژ کنم

  سناریو: شروع خرید شارژ مستقیم با اطلاعات معتبر
    با فرض کاربر صفحه خرید شارژ دیجی‌پی را باز کرده است
    هنگامی که گزینه شارژ مستقیم را انتخاب می‌کند
    و اطلاعات معتبر خرید شارژ را تکمیل می‌کند
    و روی ادامه خرید شارژ کلیک می‌کند
    آنگاه باید به مرحله تایید سفارش یا ورود هدایت شود

  سناریو: نمایش خطا برای شماره موبایل نامعتبر در خرید شارژ
    با فرض کاربر صفحه خرید شارژ دیجی‌پی را باز کرده است
    هنگامی که گزینه شارژ مستقیم را انتخاب می‌کند
    و بدون شماره موبایل معتبر ادامه می‌دهد
    و روی ادامه خرید شارژ کلیک می‌کند
    آنگاه باید پیام خطای فرم خرید شارژ نمایش داده شود
